RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (PolylineCurve)
 Converts the specified Rhino.Geometry.PolylineCurve to an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.PolylineCurve polylineCurve
)
@staticmethod
def ToCurve(
	polylineCurve: Rhino.Geometry.PolylineCurve
) -> Autodesk.Revit.DB.Curve
Parameters
polylineCurve
Type: Rhino.Geometry.PolylineCurve
Rhino polylineCurve to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino polylineCurve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.PolylineCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(PolylineCurve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = rhinoPolylineCurve.ToCurve();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_curve = rhino_polylinecurve.ToCurve()    # type: DB.Curve
 Using ToCurve(PolylineCurve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoPolylineCurve);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_curve = GE.ToCurve(rhino_polylinecurve)    # type: DB.Curve
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace